#include <string.h>
#include <jni.h>
#include <vulkan/vulkan.h>
#include <dlfcn.h>
#include <android/log.h>
#include <stdio.h>
#include <__algorithm/find_if.h>
#include <assert.h>
#include <android/log.h>
#include <iostream>
#include <fstream>
#include <string>
#include <sstream>
#include <sys/mman.h>

#define BGR 1;
#include "bcdec.h"

const char* get_vulkan_call_name(int command_id) {
    switch (command_id) {
        case 0x67: return "vkGetPhysicalDeviceProperties";
        case 0x68: return "vkGetPhysicalDeviceQueueFamilyProperties";
        case 0x69: return "vkGetPhysicalDeviceMemoryProperties";
        case 0x6a: return "vkGetPhysicalDeviceFeatures";
        case 0x6b: return "vkGetPhysicalDeviceFormatProperties";
        case 0x6c: return "vkGetPhysicalDeviceImageFormatProperties";
        case 0x6d: return "vkCreateDevice";
        case 0x6e: return "vkDestroyDevice";
        case 0x6f: return "vkEnumerateInstanceVersion";
        case 0x71: return "vkEnumerateInstanceExtensionProperties";
        case 0x73: return "vkEnumerateDeviceExtensionProperties";
        case 0x74: return "vkGetDeviceQueue";
        case 0x75: return "vkQueueSubmit";
        case 0x76: return "vkQueueWaitIdle";
        case 0x77: return "vkDeviceWaitIdle";
        case 0x78: return "vkAllocateMemory";
        case 0x79: return "vkFreeMemory";
        case 0x7a: return "vkMapMemory";
        case 0x7b: return "vkUnmapMemory";
        case 0x7c: return "vkFlushMappedMemoryRanges";

        case 0x121: return "vkCmdBeginRenderPass2";
        case 0x122: return "vkCmdNextSubpass2";
        case 0x123: return "vkCmdEndRenderPass2";
        case 0x125: return "vkWaitSemaphores";
        case 0x127: return "vkCmdDrawIndirectCount";
        case 0x128: return "vkCmdDrawIndexedIndirectCount";
        case 0x129: return "vkCmdBindTransformFeedbackBuffersEXT";
        case 0x12a: return "vkCmdBeginTransformFeedbackEXT";
        case 0x12b: return "vkCmdEndTransformFeedbackEXT";
        case 0x12c: return "vkCmdBeginQueryIndexedEXT";
        case 0x12d: return "vkCmdEndQueryIndexedEXT";
        case 0x12e: return "vkCmdDrawIndirectByteCountEXT";
        case 0x12f: return "vkGetBufferOpaqueCaptureAddress";
        case 0x130: return "vkGetBufferDeviceAddress";
        case 0x131: return "vkGetDeviceMemoryOpaqueCaptureAddress";
        case 0x132: return "vkCmdSetLineStippleEXT";
        case 0x134: return "vkCmdSetCullMode";
        case 0x135: return "vkCmdSetFrontFace";
        case 0x136: return "vkCmdSetPrimitiveTopology";
        case 0x137: return "vkCmdSetViewportWithCount";
        case 0x138: return "vkCmdSetScissorWithCount";
        case 0x139: return "vkCmdBindVertexBuffers2";
        case 0x13a: return "vkCmdSetDepthTestEnable";
        case 0x13b: return "vkCmdSetDepthWriteEnable";
        case 0x13c: return "vkCmdSetDepthCompareOp";
        case 0x13d: return "vkCmdSetDepthBoundsTestEnable";
        case 0x13e: return "vkCmdSetStencilTestEnable";
        case 0x13f: return "vkCmdSetStencilOp";
        case 0x140: return "vkCmdSetRasterizerDiscardEnable";
        case 0x141: return "vkCmdSetDepthBiasEnable";
        case 0x142: return "vkCmdSetPrimitiveRestartEnable";
        case 0x143: return "vkCmdCopyBuffer2";
        case 0x144: return "vkCmdCopyImage2";
        case 0x145: return "vkCmdBlitImage2";
        case 0x146: return "vkCmdCopyBufferToImage2";
        case 0x147: return "vkCmdCopyImageToBuffer2";
        case 0x148: return "vkCmdResolveImage2";
        case 0x149: return "vkCmdSetColorWriteEnableEXT";
        case 0x14a: return "vkCmdSetEvent2";
        case 0x14b: return "vkCmdResetEvent2";
        case 0x14c: return "vkCmdWaitEvents2";
        case 0x14d: return "vkCmdPipelineBarrier2";
        case 0x14e: return "vkQueueSubmit2";
        case 0x14f: return "vkCmdWriteTimestamp2";
        case 0x150: return "vkCmdBeginRendering";
        case 0x151: return "vkCmdEndRendering";
        case 0x152: return "vkCreateDescriptorUpdateTemplate";
        case 0x153: return "vkDestroyDescriptorUpdateTemplate";
        default:
            return "Unknown Command ID";
    }
}

extern "C" int __system_property_get(const char *name, char *value);

#define TAG "VortekPatch"
#define LOGI(...) __android_log_print(ANDROID_LOG_INFO, TAG, __VA_ARGS__)
#define LOGE(...) __android_log_print(ANDROID_LOG_ERROR, TAG, __VA_ARGS__)

int is_enabled(const char* property) {
    char value[92] = { 0 };
    return __system_property_get(property, value) > 0;
}

typedef struct { char _p[0x27]; void* task_queue; } TextureDecoder;

typedef struct {
    char _p[0xC];
    int32_t width;
    int32_t height;
    char _p2[0xC];
    void* pixel_data_buffer;
} TaskImageParams;

typedef struct {
    int fd;
    char _p[0x24];
    size_t length;
} MmapInfo;

typedef struct {
    VkBuffer         buffer;         // 0x00: The Vulkan buffer handle.
    VkDeviceSize     offset;         // 0x08: The offset into the device memory where the buffer is bound.
    MmapInfo*        mmap_details;
} TaskDataSource;

struct ImageObject {
    VkImage        handle;        // 0x00: The Vulkan image handle (Assumed).
    VkFormat       format;        // 0x08: The format of the image.
    int32_t        width;         // 0x0c: The width of the image.
    int32_t        height;        // 0x10: The height of the image.
    int32_t        layerCount;    // 0x14: The number of layers in the image.
    uint32_t       _pad_0x18;
    uint32_t       _pad_0x1c;
    VkDeviceMemory memory;        // 0x20: The device memory bound to this image.
    VkDeviceSize   size;          // 0x28: The size of the bound memory (Assumed for munmap).
}; // Size >= 0x30

typedef struct {
    TaskDataSource* data_source;
    ImageObject* image_params;
} DecodingTask;

typedef struct ArrayDeque {
    int head;
    int tail;
    unsigned int capacity;
    unsigned int _padding;
    void** elements;
} ArrayDeque;

static void (*original_TextureDecoder_decodeAll)(void* self);
static void (*original_vt_handle_vkCmdCopyBufferToImage)(void* ctx);
static void (*original_vt_handle_vkCmdCopyBufferToImage2)(void* ctx);
static void (*original_vt_handle_vkEndCommandBuffer)(void* ctx);
static void* (*original_getHandleRequestFunc)(unsigned short);

static long (*old_Java_com_winlator_xenvironment_components_VortekRendererComponent_createVkContext)(JNIEnv* env, jobject thiz, int fd, jobject options);
static int (*ArrayDeque_isEmpty)(void* deque);
static void* (*ArrayDeque_removeFirst)(void* deque);
